techauto/mipod-firmware/Documents/mipod/mipod2/sensors/nrf51422.c
/****************************************************************************************************************************************************
 ***   INCLUDES   ***********************************************************************************************************************************
 ***************************************************************************************************************************************************/

#include "nrf51422.h"

/****************************************************************************************************************************************************
 ***   TYPEDEF'S, DEFINES AND VARIABLES   ***********************************************************************************************************
 ***************************************************************************************************************************************************/

/****************************************************************************************************************************************************
 ***   PROTOTYPES   *********************************************************************************************************************************
 ***************************************************************************************************************************************************/

__STATIC_INLINE void spiWrite(uint8_t ctrlReg, uint8_t *writeData, uint8_t len);
__STATIC_INLINE void spiRead(uint8_t ctrlReg, uint8_t *readData, uint8_t len);

/****************************************************************************************************************************************************
 ***   FUNCTIONS   **********************************************************************************************************************************
 ***************************************************************************************************************************************************/
/***************************************************************************************************************************************************/
void NRFgetDeviceId(void)
{
	uint8_t *data;
	spiRead(NRF51422_DEVID_REG, data, 16);
#ifdef NRF51422_DEBUGGING
	printf("NRF51422 ID = %i\n", (int)data);
#endif
}
/***************************************************************************************************************************************************/
__STATIC_INLINE void spiWrite(uint8_t ctrlReg, uint8_t *writeData, uint8_t len)
{
	uint8_t txBuffer[len + 1];
	uint8_t rxBuffer[len + 1];

	/* Clear write indication bit */
	ctrlReg &= ~(1 << 7);

	/* Set multiple byte write bit */
	if(len > 1)
	{
		ctrlReg |= (1 << 6);
	}

	txBuffer[0] = ctrlReg;

	/* Move data buffers and transfer data */
	memcpy((uint8_t *)(txBuffer + 1), writeData, len);
	BUS_SPI_TransferNBytes(NRF51422, txBuffer, rxBuffer, (len + 1));
}

/***************************************************************************************************************************************************/
__STATIC_INLINE void spiRead(uint8_t ctrlReg, uint8_t *readData, uint8_t len)
{
	uint8_t txBuffer[len + 1];
	uint8_t rxBuffer[len + 1];

	/* Set read indication bit */
	ctrlReg |= (1 << 7);

	/* Set multiple byte read bit */
	if(len > 1)
	{
		ctrlReg |= (1 << 6);
	}

	txBuffer[0] = ctrlReg;

	/* Move data buffers and transfer data */
	BUS_SPI_TransferNBytes(NRF51422, txBuffer, rxBuffer, (len + 1));
	memcpy(readData, (uint8_t *)(rxBuffer + 1), len);
}
